Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/ac.h
/*
 * Component description for AC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-05-18T19:14:05Z */
#ifndef _PIC32CZCA80_AC_COMPONENT_H_
#define _PIC32CZCA80_AC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR AC                                           */
/* ************************************************************************** */

/* -------- AC_CTRLA : (AC Offset: 0x00) (R/W 32) Control A -------- */
#define AC_CTRLA_RESETVALUE                   _UINT32_(0x00)                                       /*  (AC_CTRLA) Control A  Reset Value */

#define AC_CTRLA_SWRST_Pos                    _UINT32_(0)                                          /* (AC_CTRLA) Software Reset Position */
#define AC_CTRLA_SWRST_Msk                    (_UINT32_(0x1) << AC_CTRLA_SWRST_Pos)                /* (AC_CTRLA) Software Reset Mask */
#define AC_CTRLA_SWRST(value)                 (AC_CTRLA_SWRST_Msk & (_UINT32_(value) << AC_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the AC_CTRLA register */
#define AC_CTRLA_ENABLE_Pos                   _UINT32_(1)                                          /* (AC_CTRLA) Enable Position */
#define AC_CTRLA_ENABLE_Msk                   (_UINT32_(0x1) << AC_CTRLA_ENABLE_Pos)               /* (AC_CTRLA) Enable Mask */
#define AC_CTRLA_ENABLE(value)                (AC_CTRLA_ENABLE_Msk & (_UINT32_(value) << AC_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the AC_CTRLA register */
#define AC_CTRLA_Msk                          _UINT32_(0x00000003)                                 /* (AC_CTRLA) Register Mask  */


/* -------- AC_CTRLB : (AC Offset: 0x04) (R/W 32) Control B -------- */
#define AC_CTRLB_RESETVALUE                   _UINT32_(0x00)                                       /*  (AC_CTRLB) Control B  Reset Value */

#define AC_CTRLB_START0_Pos                   _UINT32_(0)                                          /* (AC_CTRLB) Comparator 0 Start Comparison Position */
#define AC_CTRLB_START0_Msk                   (_UINT32_(0x1) << AC_CTRLB_START0_Pos)               /* (AC_CTRLB) Comparator 0 Start Comparison Mask */
#define AC_CTRLB_START0(value)                (AC_CTRLB_START0_Msk & (_UINT32_(value) << AC_CTRLB_START0_Pos)) /* Assigment of value for START0 in the AC_CTRLB register */
#define AC_CTRLB_START1_Pos                   _UINT32_(1)                                          /* (AC_CTRLB) Comparator 1 Start Comparison Position */
#define AC_CTRLB_START1_Msk                   (_UINT32_(0x1) << AC_CTRLB_START1_Pos)               /* (AC_CTRLB) Comparator 1 Start Comparison Mask */
#define AC_CTRLB_START1(value)                (AC_CTRLB_START1_Msk & (_UINT32_(value) << AC_CTRLB_START1_Pos)) /* Assigment of value for START1 in the AC_CTRLB register */
#define AC_CTRLB_Msk                          _UINT32_(0x00000003)                                 /* (AC_CTRLB) Register Mask  */

#define AC_CTRLB_START_Pos                    _UINT32_(0)                                          /* (AC_CTRLB Position) Comparator x Start Comparison */
#define AC_CTRLB_START_Msk                    (_UINT32_(0x3) << AC_CTRLB_START_Pos)                /* (AC_CTRLB Mask) START */
#define AC_CTRLB_START(value)                 (AC_CTRLB_START_Msk & (_UINT32_(value) << AC_CTRLB_START_Pos)) 

/* -------- AC_CTRLC : (AC Offset: 0x08) (R/W 32) Control C -------- */
#define AC_CTRLC_RESETVALUE                   _UINT32_(0x00)                                       /*  (AC_CTRLC) Control C  Reset Value */

#define AC_CTRLC_WIDTH_Pos                    _UINT32_(0)                                          /* (AC_CTRLC) Sample and Hold Clock Pulse Width Position */
#define AC_CTRLC_WIDTH_Msk                    (_UINT32_(0x3FF) << AC_CTRLC_WIDTH_Pos)              /* (AC_CTRLC) Sample and Hold Clock Pulse Width Mask */
#define AC_CTRLC_WIDTH(value)                 (AC_CTRLC_WIDTH_Msk & (_UINT32_(value) << AC_CTRLC_WIDTH_Pos)) /* Assigment of value for WIDTH in the AC_CTRLC register */
#define AC_CTRLC_PER_Pos                      _UINT32_(12)                                         /* (AC_CTRLC) Sample and Hold Clock Period Position */
#define AC_CTRLC_PER_Msk                      (_UINT32_(0x3FF) << AC_CTRLC_PER_Pos)                /* (AC_CTRLC) Sample and Hold Clock Period Mask */
#define AC_CTRLC_PER(value)                   (AC_CTRLC_PER_Msk & (_UINT32_(value) << AC_CTRLC_PER_Pos)) /* Assigment of value for PER in the AC_CTRLC register */
#define AC_CTRLC_PRESCALER_Pos                _UINT32_(24)                                         /* (AC_CTRLC) Prescaling Factor Position */
#define AC_CTRLC_PRESCALER_Msk                (_UINT32_(0x7) << AC_CTRLC_PRESCALER_Pos)            /* (AC_CTRLC) Prescaling Factor Mask */
#define AC_CTRLC_PRESCALER(value)             (AC_CTRLC_PRESCALER_Msk & (_UINT32_(value) << AC_CTRLC_PRESCALER_Pos)) /* Assigment of value for PRESCALER in the AC_CTRLC register */
#define   AC_CTRLC_PRESCALER_DIV1_Val         _UINT32_(0x0)                                        /* (AC_CTRLC) Sampling rate is GCLK_AC (No division)  */
#define   AC_CTRLC_PRESCALER_DIV2_Val         _UINT32_(0x1)                                        /* (AC_CTRLC) Sampling rate is GCLK_AC/2  */
#define   AC_CTRLC_PRESCALER_DIV4_Val         _UINT32_(0x2)                                        /* (AC_CTRLC) Sampling rate is GCLK_AC/4  */
#define   AC_CTRLC_PRESCALER_DIV8_Val         _UINT32_(0x3)                                        /* (AC_CTRLC) Sampling rate is GCLK_AC/8  */
#define   AC_CTRLC_PRESCALER_DIV16_Val        _UINT32_(0x4)                                        /* (AC_CTRLC) Sampling rate is GCLK_AC/16  */
#define   AC_CTRLC_PRESCALER_DIV32_Val        _UINT32_(0x5)                                        /* (AC_CTRLC) Sampling rate is GCLK_AC/32  */
#define   AC_CTRLC_PRESCALER_DIV64_Val        _UINT32_(0x6)                                        /* (AC_CTRLC) Sampling rate is GCLK_AC/64  */
#define   AC_CTRLC_PRESCALER_DIV128_Val       _UINT32_(0x7)                                        /* (AC_CTRLC) Sampling rate is GCLK_AC/128  */
#define AC_CTRLC_PRESCALER_DIV1               (AC_CTRLC_PRESCALER_DIV1_Val << AC_CTRLC_PRESCALER_Pos) /* (AC_CTRLC) Sampling rate is GCLK_AC (No division) Position  */
#define AC_CTRLC_PRESCALER_DIV2               (AC_CTRLC_PRESCALER_DIV2_Val << AC_CTRLC_PRESCALER_Pos) /* (AC_CTRLC) Sampling rate is GCLK_AC/2 Position  */
#define AC_CTRLC_PRESCALER_DIV4               (AC_CTRLC_PRESCALER_DIV4_Val << AC_CTRLC_PRESCALER_Pos) /* (AC_CTRLC) Sampling rate is GCLK_AC/4 Position  */
#define AC_CTRLC_PRESCALER_DIV8               (AC_CTRLC_PRESCALER_DIV8_Val << AC_CTRLC_PRESCALER_Pos) /* (AC_CTRLC) Sampling rate is GCLK_AC/8 Position  */
#define AC_CTRLC_PRESCALER_DIV16              (AC_CTRLC_PRESCALER_DIV16_Val << AC_CTRLC_PRESCALER_Pos) /* (AC_CTRLC) Sampling rate is GCLK_AC/16 Position  */
#define AC_CTRLC_PRESCALER_DIV32              (AC_CTRLC_PRESCALER_DIV32_Val << AC_CTRLC_PRESCALER_Pos) /* (AC_CTRLC) Sampling rate is GCLK_AC/32 Position  */
#define AC_CTRLC_PRESCALER_DIV64              (AC_CTRLC_PRESCALER_DIV64_Val << AC_CTRLC_PRESCALER_Pos) /* (AC_CTRLC) Sampling rate is GCLK_AC/64 Position  */
#define AC_CTRLC_PRESCALER_DIV128             (AC_CTRLC_PRESCALER_DIV128_Val << AC_CTRLC_PRESCALER_Pos) /* (AC_CTRLC) Sampling rate is GCLK_AC/128 Position  */
#define AC_CTRLC_AIPMPEN_Pos                  _UINT32_(27)                                         /* (AC_CTRLC) Analog Input Charge Pump Enable Position */
#define AC_CTRLC_AIPMPEN_Msk                  (_UINT32_(0x1) << AC_CTRLC_AIPMPEN_Pos)              /* (AC_CTRLC) Analog Input Charge Pump Enable Mask */
#define AC_CTRLC_AIPMPEN(value)               (AC_CTRLC_AIPMPEN_Msk & (_UINT32_(value) << AC_CTRLC_AIPMPEN_Pos)) /* Assigment of value for AIPMPEN in the AC_CTRLC register */
#define AC_CTRLC_CONFIG_Pos                   _UINT32_(28)                                         /* (AC_CTRLC) Configuration Extension Position */
#define AC_CTRLC_CONFIG_Msk                   (_UINT32_(0xF) << AC_CTRLC_CONFIG_Pos)               /* (AC_CTRLC) Configuration Extension Mask */
#define AC_CTRLC_CONFIG(value)                (AC_CTRLC_CONFIG_Msk & (_UINT32_(value) << AC_CTRLC_CONFIG_Pos)) /* Assigment of value for CONFIG in the AC_CTRLC register */
#define AC_CTRLC_Msk                          _UINT32_(0xFF3FF3FF)                                 /* (AC_CTRLC) Register Mask  */


/* -------- AC_EVCTRL : (AC Offset: 0x0C) (R/W 32) Event Control -------- */
#define AC_EVCTRL_RESETVALUE                  _UINT32_(0x00)                                       /*  (AC_EVCTRL) Event Control  Reset Value */

